---
kind: property
id: P:Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewName
source: html/44d6d03b-b881-429a-fb93-c7fb026825e1.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.NewName Property

The name of the newly duplicated ElementType.

## Syntax (C#)
```csharp
public string NewName { get; }
```